ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_epwm_xbar_regs.xml
	</group>
	<register id="PWMXBAROutInvert" width="32" page="0" offset="0x30" instances="1" instaddr="4" internal="0" description="Output Signal Invert Select">
		<bitfield id="XBAR1" description="Invert XBAR Output Select for XBAR1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="XBAR2" description="Invert XBAR Output Select for XBAR2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="XBAR3" description="Invert XBAR Output Select for XBAR3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="XBAR4" description="Invert XBAR Output Select for XBAR4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="XBAR5" description="Invert XBAR Output Select for XBAR5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="XBAR6" description="Invert XBAR Output Select for XBAR6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="XBAR7" description="Invert XBAR Output Select for XBAR7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="XBAR8" description="Invert XBAR Output Select for XBAR8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="XBAR9" description="Invert XBAR Output Select for XBAR9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="XBAR10" description="Invert XBAR Output Select for XBAR10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="XBAR11" description="Invert XBAR Output Select for XBAR11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="XBAR12" description="Invert XBAR Output Select for XBAR12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="XBAR13" description="Invert XBAR Output Select for XBAR13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="XBAR14" description="Invert XBAR Output Select for XBAR14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="XBAR15" description="Invert XBAR Output Select for XBAR15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="XBAR16" description="Invert XBAR Output Select for XBAR16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PWMXBARLock" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="Configuration Lock register">
		<bitfield id="LOCK" description="Locks the configuration for EPWM-XBAR" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Write protection KEY" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
</module>
